Public Attributes | List of all members
API_DescriptorRefType Struct Reference
Element Manager API
The descriptor reference record. More...
#include <APIdefs_Elements.h>
 Public Attributes
Int32  | libIndex
Index of the library part, place of the descriptor declaring.
Int32  | setIndex
Index of the listing database set, if status equals APIDBRef_Normal.
Int32  | index
This member depends on the status field. If status equals APIDBRef _Normal, then index is index of the descriptor in the set, if status equals APIDBRef _Local, then index is index of the descriptor in the library part.
Int32  | status
This member is status of descriptor(APIDBRef__Normal, APIDBRef__Local, APIDBRef_Deleted).
Detailed Description
The descriptor reference record.
Remarks
This structure is used when you want to get the descriptors of an element. These descriptors are in the property objects of the element. See the ACAPI_Element_GetDescriptors function.
Member Data Documentation
◆ index
 API_DescriptorRefType::index
This member depends on the status field. If status equals APIDBRef _Normal, then index is index of the descriptor in the set, if status equals APIDBRef _Local, then index is index of the descriptor in the library part.
◆ libIndex
 API_DescriptorRefType::libIndex
Index of the library part, place of the descriptor declaring.
◆ setIndex
 API_DescriptorRefType::setIndex
Index of the listing database set, if status equals APIDBRef_Normal.
◆ status
 API_DescriptorRefType::status
This member is status of descriptor(APIDBRef__Normal, APIDBRef__Local, APIDBRef_Deleted).